{
	"profiles": [

		{
			"name": "Ernest Cappellacci",
			"title": "Lawyer",
			"phone_number": "(416) 955-9501",
			"email_address": "ecappellacci@capplaw.ca",
			"profile_photo": "https://raw.githubusercontent.com/t-yauk/capplawimages/main/ernest-cappellacci-2025.jpg",
			"mobile_image": "https://raw.githubusercontent.com/t-yauk/capplawimages/main/ernie-cappellacci-mobile.jpg",
			"description": "For more than 40 years, lawyer Ernest Cappellacci has been primarily advising Toronto-based health care providers on corporate and commercial matters, along with a variety of more specialized services within the health care field.<br><br>Mr. Cappellacci's clients have included doctors, other health care professionals, hospital medical staff groups, provincial physician specialist associations and health care companies.<br><br>Mr. Cappellacci acts as legal counsel to specialist physician provincial associations advising on various issues including legislative, regulatory and policy changes affecting them, as well as internal corporate matters. He also has provided corporate and commercial law services to non-health care business corporations."
		},

		{
			"name": "Gina DaRoza",
			"title": "Lawyer",
			"phone_number": "(416) 955-9502",
			"email_address": "gdaroza@capplaw.ca",
			"profile_photo": "https://raw.githubusercontent.com/t-yauk/capplawimages/main/gina-daroza-2025.jpg",
			"mobile_image": "https://raw.githubusercontent.com/t-yauk/capplawimages/main/gina-daroza-mobile.jpg",
			"description": "Ms. DaRoza focusses her Toronto practice on health and business law and has extensive experience representing a broad range of health care providers and other business entrepreneurs.<br><br>Gina DaRoza was awarded the University gold medal for highest standing at the University of Manitoba (BSc.) where she received her law degree with distinction. She began her legal practice with a major Toronto law firm upon her call to the bar in 1991, where she practised with a special emphasis on corporate/commercial and health law.<br><br>For many years she has been assisting dentists, physicians and other health care professionals in setting up their practices, purchasing and selling their practices, using corporations in their practice, corporate reorganizations, lease negotiations, partnership, cost-sharing and shareholder arrangements and many other services."
		},

		{
			"name": "Jeffrey Murray",
			"title": "Lawyer",
			"phone_number": "(416) 955-1681",
			"email_address": "jmurray@capplaw.ca",
			"profile_photo": "https://raw.githubusercontent.com/t-yauk/capplawimages/main/jeff-murray-old.jpeg",
			"mobile_image": "https://raw.githubusercontent.com/t-yauk/capplawimages/main/jeff-murray-mobile.jpg",
			"description": "Jeff is a business minded lawyer and practices corporate and commercial law with a particular emphasis on health care. Jeff regularly advises physicians, pharmacists, dentists, veterinarians and other health care professionals and investors in connection with a wide variety of corporate and commercial matters.<br><br>Jeff joined Cappellacci DaRoza LLP in 2017. Prior to joining Cappellacci DaRoza, Jeff practiced for more than a decade in the Toronto and New York offices of a leading international business law firm, most recently as a member of the Health Industry Group. In addition to his health care experience, Jeff has significant experience providing corporate, commercial and Mergers & Acquisitions advice to clients in connection with investments and operations in many other industries and economic sectors.<br><br>Jeff completed his legal studies at Osgoode Hall Law School and received a Bachelor of Arts from McMaster University where he was selected valedictorian for his graduating class.<br><br>In 2014, Jeff received a certificate in Health Law from Osgoode Hall Law School."
		},

		{
			"name": "Stacy Hogan",
			"title": "Law Clerk",
			"phone_number": "(416) 955-1280",
			"email_address": "stacy@capplaw.ca",
			"profile_photo": "https://raw.githubusercontent.com/t-yauk/capplawimages/main/stacy-hogan-old.jpg",
			"mobile_image": "https://raw.githubusercontent.com/t-yauk/capplawimages/main/stacy-hogan-mobile.jpg",
			"description": "Stacy is a corporate and transactions Law Clerk working primarily with Gina DaRoza (with an expertise in dental purchase and sale transactions). Stacy has over 25 years’ experience in various corporate matters. She began working with the firm in 1996 and left for a short period. During her “sabbatical”, Stacy worked in the corporate departments of two Toronto law firms, and is now back doing what she likes best: transactional work, including purchase and sale transactions, corporate reorganizations and drafting various corporate and commercial documents.<br><br>She has also had extensive experience in setting up and maintaining various corporations including professional corporations, federal corporations, licensee corporations and non-share capital corporations. Stacy is a member of the Institute of Law Clerks of Ontario and a Commissioner of Oaths."
		},

		{
			"name": "Karly Hoar",
			"title": "Corporate Law Clerk/Executive Assistant",
			"phone_number": "(416) 955-9500",
			"email_address": "karly@capplaw.ca",
			"profile_photo": "https://raw.githubusercontent.com/t-yauk/capplawimages/main/karly-hoar-2025.jpg",
			"mobile_image": "https://raw.githubusercontent.com/t-yauk/capplawimages/main/karly-hoar-mobile.jpg",
			"description": "Karly is Ernest J. Cappellacci`s executive assistant and corporate law clerk and has been with Cappellacci DaRoza LLP since 2019. She has successfully completed the corporate law course with the Institute of Law Clerks of Ontario.<br><br>Karly is also a Licensed Paralegal holding her P1 License to practice law with the Law Society of Ontario and has been licensed since 2016. Prior to joining Cappellacci DaRoza LLP, Karly practiced in the area of plaintiff personal injury and had successfully represented clients at the Licence Appeal Tribunal. Karly holds a Bachelor of Arts Degree with Honors from McMaster University and a Graduate Certificate from Conestoga College for her Paralegal degree.<br><br>Karly was also a national level gymnast and represented both Ontario and Canada at international competitions before becoming a competitive cheerleader. During her cheerleading career, she represented many teams including Team Canada All Girl Elite at three World Championships (winning all three gold medals)."
		},

		{
			"name": "Judaa St. Bernard",
			"title": "Law Clerk",
			"phone_number": "(416) 955-9500",
			"email_address": "judaa@capplaw.ca",
			"profile_photo": "https://raw.githubusercontent.com/t-yauk/capplawimages/main/judaa-st-bernard-old.jpg",
			"mobile_image": "https://raw.githubusercontent.com/t-yauk/capplawimages/main/judaa-st-bernard-mobile.jpg",
			"description": "Judaa St. Bernard has been working at Cappellacci DaRoza LLP since 2014. She started as a legal assistant and is now a qualified law clerk. Over the years, Judaa has assisted with various levels of corporate work, including registration and renewal of business styles, the preparation of annual resolutions and dividend minutes, incorporation and organization of Ontario corporations, as well as more complicated corporate work such as corporate reorganizations, purchase and sale transactions and maintaining some of our group clients. In addition to legal work, Judaa takes pride in being “in-house IT” for our firm and a general go-to person for all other office matters."
		}
		
	]
}
